In [2]:
import pandas as pd

In [3]:
l1=["Manish","Mayank","Rajeev"]

In [4]:
type(l1)

list

In [5]:
s1=pd.Series(l1)

In [6]:
s1

0    Manish
1    Mayank
2    Rajeev
dtype: object

In [47]:
# s1.info() as its having only object data type with no null values

AttributeError: 'Series' object has no attribute 'info'

In [7]:
s1.dtype

dtype('O')

In [14]:
s1[0:1]

0    Manish
dtype: object

DataFrame

In [19]:
d1=pd.DataFrame([[1,2,3],l1,["aa","bb","cc"]])

In [20]:
d1

        0       1       2
0       1       2       3
1  Manish  Mayank  Rajeev
2      aa      bb      cc

In [58]:
a={
    "name":["Praveen","manish"],
    "age":[26,10],
    "forte":["Data Analytics","Da"]
}

In [59]:
a

{'name': ['Praveen', 'manish'],
 'age': [26, 10],
 'forte': ['Data Analytics', 'Da']}

In [60]:
q=pd.DataFrame(a)

In [61]:
q

      name  age           forte
0  Praveen   26  Data Analytics
1   manish   10              Da

In [62]:
q.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    2 non-null      object
 1   age     2 non-null      int64
 2   forte   2 non-null      object
dtypes: int64(1), object(2)
memory usage: 176.0+ bytes

In [63]:
print(type(q))

<class 'pandas.core.frame.DataFrame'>

In [64]:
# q.dtype as we are having multiple data types

In [65]:
q.axes

[RangeIndex(start=0, stop=2, step=1),
 Index(['name', 'age', 'forte'], dtype='object')]

In [66]:
data=pd.read_csv("User_Data.csv")

In [69]:
data

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [68]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [71]:
data.isnull().sum()

User ID            0
Gender             0
Age                0
EstimatedSalary    0
Purchased          0
dtype: int64